let blockedWords = ["رقم تواصل", "واتس اب", "تلغرام", "نتواصل", "تواصل", "تواصل معنا","واتس" ,"تيلي","تواصل معنا على", "تواصل معنا على واتس اب", "تواصل معنا على تلغرام", "تواصل معنا على رقم تواصل", "تواصل معنا على نتواصل", "تواصل معنا على نتواصل معنا", "تواصل معنا على نتواصل معنا على واتس اب", "تواصل معنا على نتواصل معنا على تلغرام"];

let message = prompt("أدخل رسالتك:");
let count = 0;

blockedWords.forEach((word) => {
  if (message.includes(word)) {
    count++;
  }
});

if (count >= 2) {
  alert("هذه الرسالة غير مرغوب بها داخل المنصة.");
} else {
  alert("مرحبا بك ف المنصة!");
}
